{"posts":[{"id":"2f628a2f-fa03-4c88-82db-5474f1fa1ab5","title":"The promise of generative AI in low-code, testing","description":"Just as low code lowered the bar to entry for development, generative AI will have a similar impact because of such things as code completion and workflow automation. But Kyle Davis, VP analyst at Gartner,  believes that the two technologies will interact in more of a collaborative effort than a competitive way, at least for citizen developers. “Even though you could use generative AI to generate code, if you don’t understand what the code is doing, there’s no way to validate that it’s correct,” he said. “Using low code, it’s declarative, so you can look at what’s there on the screen and say, ‘does that make sense?’”","image":"https://sdtimes.com/wp-content/uploads/2023/11/Generative-AILow-Code-Buyers-Guide-2.png","date":"2023-11-26"},{"id":"cf9ab078-a4e5-40a0-8327-74327d52b7a7","title":"Roger Federer","description":"The official ambassador of Swiss tourism, Roger Federer, was celebrated in Basel, Switzerland this week as a tram was named after him. The Federer Express tram celebrates the 20-time Grand Slam winner with photos of some of his most iconic moments sprawled on the outside, while the inside features facts and information about the Swiss Star and some of the seats are reminiscent of chairs that can be found on the side of a court during a changeover.\n\n\"The project was very important to me. That is why it is a great honor for me to be able to see the tram on the streets of Basel in the future,\" said Roger.\n\n","image":"https://www.rogerfederer.com/images/BVB-Roger-Federer-Tram-009.jpg","date":"2023-12-08"},{"id":"15a5a9fd-97fe-4fe6-b165-63ab1d1b8f4b","title":"Ney Mar Jr","description":"The Brazilian joined from PSG this summer with no other club able to financially compete with what Saudi Arabia's sides can offer.\n\nNeymar's Al-Hilal debut\nNeymar will not play against Karim Benzema, N'Golo Kante and the rest of their Al-Ittihad teammates on Friday, September 1.\n","image":"https://phantom-marca.unidadeditorial.es/367303655813626a6cf1b8c46fbab671/crop/0x0/2044x1363/resize/828/f/webp/assets/multimedia/imagenes/2023/09/01/16935900900609.jpg","date":"2023-12-21"}]}